paper/get_set_benchmark/raw/idlekv-get-set-1-1.txt
4         Threads
64        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      3880312.25          ---          ---         2.51900         1.95900         7.64700        11.71100    295145.74 
Gets      3880312.25    710208.16   3170104.10         2.51900         1.95900         7.64700        11.71100    170944.81 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    7760624.51    710208.16   3170104.10         2.51900         1.95900         7.64700        11.71100    466090.55 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       0.895        5.000
SET       1.055       10.000
SET       1.167       15.000
SET       1.271       20.000
SET       1.367       25.000
SET       1.463       30.000
SET       1.567       35.000
SET       1.687       40.000
SET       1.815       45.000
SET       1.959       50.000
SET       2.039       52.500
SET       2.143       55.000
SET       2.239       57.500
SET       2.351       60.000
SET       2.479       62.500
SET       2.607       65.000
SET       2.767       67.500
SET       2.943       70.000
SET       3.135       72.500
SET       3.327       75.000
SET       3.423       76.250
SET       3.535       77.500
SET       3.631       78.750
SET       3.743       80.000
SET       3.871       81.250
SET       3.983       82.500
SET       4.127       83.750
SET       4.255       85.000
SET       4.383       86.250
SET       4.511       87.500
SET       4.607       88.125
SET       4.671       88.750
SET       4.767       89.375
SET       4.831       90.000
SET       4.927       90.625
SET       5.023       91.250
SET       5.119       91.875
SET       5.215       92.500
SET       5.311       93.125
SET       5.439       93.750
SET       5.503       94.062
SET       5.567       94.375
SET       5.631       94.688
SET       5.727       95.000
SET       5.791       95.312
SET       5.887       95.625
SET       5.951       95.938
SET       6.047       96.250
SET       6.143       96.562
SET       6.271       96.875
SET       6.335       97.031
SET       6.399       97.188
SET       6.463       97.344
SET       6.527       97.500
SET       6.591       97.656
SET       6.687       97.812
SET       6.783       97.969
SET       6.847       98.125
SET       6.975       98.281
SET       7.071       98.438
SET       7.135       98.516
SET       7.199       98.594
SET       7.295       98.672
SET       7.359       98.750
SET       7.423       98.828
SET       7.519       98.906
SET       7.615       98.984
SET       7.711       99.062
SET       7.839       99.141
SET       7.967       99.219
SET       8.031       99.258
SET       8.127       99.297
SET       8.191       99.336
SET       8.319       99.375
SET       8.383       99.414
SET       8.511       99.453
SET       8.639       99.492
SET       8.767       99.531
SET       8.895       99.570
SET       9.023       99.609
SET       9.151       99.629
SET       9.215       99.648
SET       9.343       99.668
SET       9.471       99.688
SET       9.535       99.707
SET       9.663       99.727
SET       9.855       99.746
SET       9.983       99.766
SET      10.111       99.785
SET      10.303       99.805
SET      10.367       99.814
SET      10.495       99.824
SET      10.623       99.834
SET      10.751       99.844
SET      10.879       99.854
SET      11.071       99.863
SET      11.263       99.873
SET      11.391       99.883
SET      11.583       99.893
SET      11.775       99.902
SET      11.903       99.907
SET      12.031       99.912
SET      12.159       99.917
SET      12.287       99.922
SET      12.479       99.927
SET      12.607       99.932
SET      12.799       99.937
SET      13.055       99.941
SET      13.311       99.946
SET      13.567       99.951
SET      13.759       99.954
SET      13.887       99.956
SET      14.079       99.958
SET      14.207       99.961
SET      14.335       99.963
SET      14.463       99.966
SET      14.719       99.968
SET      14.911       99.971
SET      15.103       99.973
SET      15.295       99.976
SET      15.423       99.977
SET      15.615       99.978
SET      15.807       99.979
SET      15.935       99.980
SET      16.127       99.982
SET      16.255       99.983
SET      16.511       99.984
SET      16.767       99.985
SET      17.023       99.987
SET      17.407       99.988
SET      17.535       99.988
SET      17.663       99.989
SET      17.919       99.990
SET      18.047       99.990
SET      18.303       99.991
SET      18.559       99.991
SET      19.071       99.992
SET      19.583       99.993
SET      19.967       99.993
SET      20.223       99.994
SET      20.223       99.994
SET      20.351       99.995
SET      20.479       99.995
SET      20.735       99.995
SET      20.863       99.995
SET      21.247       99.996
SET      21.503       99.996
SET      21.759       99.996
SET      21.887       99.997
SET      22.015       99.997
SET      22.271       99.997
SET      22.399       99.997
SET      22.527       99.997
SET      22.527       99.998
SET      22.655       99.998
SET      22.783       99.998
SET      22.911       99.998
SET      23.039       99.998
SET      23.679       99.998
SET      23.807       99.998
SET      23.807       99.999
SET      23.935       99.999
SET      23.935       99.999
SET      24.063       99.999
SET      24.191       99.999
SET      24.319       99.999
SET      24.319       99.999
SET      24.319       99.999
SET      24.447       99.999
SET      24.703       99.999
SET      24.703       99.999
SET      24.703       99.999
SET      24.831       99.999
SET      24.959       99.999
SET      25.087       99.999
SET      25.215       99.999
SET      25.343      100.000
SET      25.343      100.000
SET      25.471      100.000
SET      25.599      100.000
SET      25.599      100.000
SET      25.599      100.000
[...]
SET      25.855      100.000
SET      25.983      100.000
SET      26.367      100.000
SET      26.367      100.000
SET      26.367      100.000
SET      26.495      100.000
SET      26.495      100.000
SET      26.495      100.000
[...]
SET      26.623      100.000
SET      26.623      100.000
SET      26.623      100.000
[...]
SET      26.751      100.000
SET      26.751      100.000
---
GET       0.023        0.000
GET       0.895        5.000
GET       1.055       10.000
GET       1.167       15.000
GET       1.271       20.000
GET       1.367       25.000
GET       1.463       30.000
GET       1.567       35.000
GET       1.687       40.000
GET       1.815       45.000
GET       1.959       50.000
GET       2.039       52.500
GET       2.143       55.000
GET       2.239       57.500
GET       2.351       60.000
GET       2.479       62.500
GET       2.607       65.000
GET       2.767       67.500
GET       2.943       70.000
GET       3.135       72.500
GET       3.327       75.000
GET       3.423       76.250
GET       3.535       77.500
GET       3.631       78.750
GET       3.743       80.000
GET       3.871       81.250
GET       3.983       82.500
GET       4.127       83.750
GET       4.255       85.000
GET       4.383       86.250
GET       4.511       87.500
GET       4.607       88.125
GET       4.671       88.750
GET       4.767       89.375
GET       4.831       90.000
GET       4.927       90.625
GET       5.023       91.250
GET       5.119       91.875
GET       5.215       92.500
GET       5.311       93.125
GET       5.439       93.750
GET       5.503       94.062
GET       5.567       94.375
GET       5.631       94.688
GET       5.727       95.000
GET       5.791       95.312
GET       5.887       95.625
GET       5.951       95.938
GET       6.047       96.250
GET       6.143       96.562
GET       6.271       96.875
GET       6.335       97.031
GET       6.399       97.188
GET       6.463       97.344
GET       6.527       97.500
GET       6.591       97.656
GET       6.687       97.812
GET       6.783       97.969
GET       6.847       98.125
GET       6.975       98.281
GET       7.071       98.438
GET       7.135       98.516
GET       7.199       98.594
GET       7.295       98.672
GET       7.359       98.750
GET       7.423       98.828
GET       7.519       98.906
GET       7.615       98.984
GET       7.711       99.062
GET       7.839       99.141
GET       7.967       99.219
GET       8.031       99.258
GET       8.127       99.297
GET       8.191       99.336
GET       8.319       99.375
GET       8.383       99.414
GET       8.511       99.453
GET       8.639       99.492
GET       8.767       99.531
GET       8.895       99.570
GET       9.023       99.609
GET       9.151       99.629
GET       9.215       99.648
GET       9.343       99.668
GET       9.471       99.688
GET       9.535       99.707
GET       9.663       99.727
GET       9.855       99.746
GET       9.983       99.766
GET      10.111       99.785
GET      10.303       99.805
GET      10.367       99.814
GET      10.495       99.824
GET      10.623       99.834
GET      10.751       99.844
GET      10.879       99.854
GET      11.071       99.863
GET      11.263       99.873
GET      11.391       99.883
GET      11.583       99.893
GET      11.775       99.902
GET      11.903       99.907
GET      12.031       99.912
GET      12.159       99.917
GET      12.287       99.922
GET      12.479       99.927
GET      12.607       99.932
GET      12.799       99.937
GET      13.055       99.941
GET      13.311       99.946
GET      13.567       99.951
GET      13.759       99.954
GET      13.887       99.956
GET      14.079       99.958
GET      14.207       99.961
GET      14.335       99.963
GET      14.463       99.966
GET      14.719       99.968
GET      14.911       99.971
GET      15.103       99.973
GET      15.295       99.976
GET      15.423       99.977
GET      15.615       99.978
GET      15.807       99.979
GET      15.935       99.980
GET      16.127       99.982
GET      16.255       99.983
GET      16.511       99.984
GET      16.767       99.985
GET      17.023       99.987
GET      17.407       99.988
GET      17.535       99.988
GET      17.663       99.989
GET      17.919       99.990
GET      18.047       99.990
GET      18.303       99.991
GET      18.559       99.991
GET      19.071       99.992
GET      19.583       99.993
GET      19.967       99.993
GET      20.223       99.994
GET      20.223       99.994
GET      20.351       99.995
GET      20.479       99.995
GET      20.735       99.995
GET      20.863       99.995
GET      21.247       99.996
GET      21.503       99.996
GET      21.759       99.996
GET      21.887       99.997
GET      22.015       99.997
GET      22.271       99.997
GET      22.399       99.997
GET      22.527       99.997
GET      22.527       99.998
GET      22.655       99.998
GET      22.783       99.998
GET      22.911       99.998
GET      23.039       99.998
GET      23.679       99.998
GET      23.807       99.998
GET      23.807       99.999
GET      23.935       99.999
GET      23.935       99.999
GET      24.063       99.999
GET      24.191       99.999
GET      24.319       99.999
GET      24.319       99.999
GET      24.319       99.999
GET      24.447       99.999
GET      24.703       99.999
GET      24.703       99.999
GET      24.703       99.999
GET      24.831       99.999
GET      24.959       99.999
GET      25.087       99.999
GET      25.215       99.999
GET      25.343      100.000
GET      25.343      100.000
GET      25.471      100.000
GET      25.599      100.000
GET      25.599      100.000
GET      25.599      100.000
[...]
GET      25.855      100.000
GET      25.983      100.000
GET      26.367      100.000
GET      26.367      100.000
GET      26.367      100.000
GET      26.495      100.000
GET      26.495      100.000
GET      26.495      100.000
[...]
GET      26.623      100.000
GET      26.623      100.000
GET      26.623      100.000
[...]
GET      26.751      100.000
GET      26.751      100.000
---
WAIT      0.000      100.000